IdeaRS.Connections
MemberTransversalStiffenerData Properties
Compatible with IDEA StatiCa 0.0
The MemberTransversalStiffenerData type exposes the following members.
Properties
Name | Description
CapPlateOffset |  (Inherited from StiffenerData.)
Delta
 Gets or sets the distance between repeated stiffeners
 (Inherited from StiffenerData.)
Gap
 Gets or sets the gap between the outline of the stiffener and particular plates of the beam
 (Inherited from StiffenerData.)
ChamferCorners
 If true corners are chamfered
 (Inherited from StiffenerData.)
ChamferSize
 Gets or sets the size of the chamfer
 (Inherited from StiffenerData.)
IsActive |  (Inherited from ConnectionCmdData.)
IsCapPlate |  (Inherited from StiffenerData.)
Location
 Gets or sets the location of the stiffener
 (Inherited from StiffenerData.)
MemberPath
 Gets or sets the member to which the stiffener is connected
 (Inherited from StiffenerData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NumberOfStiffeners
 Gets or sets the number of stiffeners (the property Delta represents the distance between repeating stiffeners)
 (Inherited from StiffenerData.)
OffsetBottom
 Gets or sets the offset of stiffener on the bottom edge.
 (Inherited from StiffenerData.)
OffsetTop
 Gets or sets the offset of stiffener on the top edge.
 (Inherited from StiffenerData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PosOnMember
 Gets or sets the position of the stiffener on the member
 (Inherited from StiffenerData.)
ReferenceBoundingBoxSide
 Gets or sets the sides on bounding box of the reference member. Stiffeners will be placed according to these planes
 (Inherited from StiffenerData.)
ReferenceMemberPath
 Gets or sets the reference member (stiffeners will be placed according to this member)
 (Inherited from StiffenerData.)
RemainingPart |  (Inherited from StiffenerData.)
Rotation
 Gets or sets the rotation of the stiffener
 (Inherited from StiffenerData.)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
StiffenerWidth
 Gets or sets the width of the stiffener
 (Inherited from StiffenerData.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
TubeCircStiffDiam
 The diameter of the circular stiffener (tubes)
 (Inherited from StiffenerData.)
TubeRectStiffHeight
 The height of the rectangular stiffener (tubes)
 (Inherited from StiffenerData.)
TubeRectStiffRotation
 The rotation of the rectangular stiffener (tubes)
 (Inherited from StiffenerData.)
TubeRectStiffWidth
 The width of the rectangular stiffener (tubes)
 (Inherited from StiffenerData.)
TubeStiffShape
 Shape of the stiffener on tubes
 (Inherited from StiffenerData.)
Weld
 Gets or sets the properties of the weld
 (Inherited from StiffenerData.)
Top
See Also
Reference
MemberTransversalStiffenerData Class
IdeaRS.Connections.Data Namespace